# ContextualAnalyticalModelModeNotEnabled Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AnalyticalModelFailures..::..ContextualAnalyticalModelModeNotEnabled Property
BuiltInFailures..::..AnalyticalModelFailures Class See Also
---
Contextual Analytical Model not enabled. File open was canceled.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ContextualAnalyticalModelModeNotEnabled { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ContextualAnalyticalModelModeNotEnabled As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ContextualAnalyticalModelModeNotEnabled {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace